resources/information/technologies/xml/webServices/soap/structure/src/msgAddPerson02.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope 
    xmlns="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:service="http://example.org/hr/webservice"
    xmlns:people="http://example.org/hr/people">
    <Body>
        <addPersonRequest xmlns="http://example.org/hr/webservice">
            <person xsi:type="people:Employee">
                <people:firstName>John</people:firstName>
                <people:lastName>Deere</people:lastName>
                <people:birthDate>1971-06-07</people:birthDate>
                <people:joinDate>2004-01-01</people:joinDate>
                <people:empNo>1337</people:empNo>
            </person>
        </addPersonRequest>
    </Body>
</Envelope>
